exampleCases/example.4.piso.DTU10MW.ALMAdvanced.refinements/system/topoSetDict.local.2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict.local.2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
actions
(
    {
        name         local;
        type         cellSet;
        action       new;
        source       rotatedBoxToCell;
        sourceInfo
        {
            origin (   300.0  300.0   0.0);
            i      (   900.0    0.0   0.0);
            j      (     0.0  400.0   0.0);
            k      (     0.0    0.0 250.0);
        }
    }
 
);
 
// ************************************************************************* //
